Adventure Work cycles customer data

In [3]:
import pandas as pd
customers = pd.read_csv("AWCustomers.csv")
customers.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [6]:
customers.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [4]:
sales = pd.read_csv("AWSales.csv")
sales.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend'], dtype='object')

In [8]:
merged_df = pd.merge(customers, sales, on='CustomerID', how='inner')
merged_df.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated', 'BikeBuyer', 'AvgMonthSpend'],
      dtype='object')

In [12]:
selected_cols = ["Education","BirthDate","NumberCarsOwned","Occupation","MaritalStatus","HomeOwnerFlag","TotalChildren","YearlyIncome","BikeBuyer"]
#Filters out selected cols from merged one
selected_df = merged_df[selected_cols]
selected_df.head()

,Education,BirthDate,NumberCarsOwned,Occupation,MaritalStatus,HomeOwnerFlag,TotalChildren,YearlyIncome,BikeBuyer
0,Bachelors,1987-11-13,3,Clerical,M,1,1,81916,1
1,Partial College,1972-07-21,2,Clerical,M,1,2,81076,1
2,Bachelors,1985-11-09,3,Clerical,S,0,0,86387,1
3,Partial College,1977-10-18,2,Skilled Manual,M,1,2,61481,1
4,Partial College,1975-02-05,1,Skilled Manual,S,1,0,51804,1

In [14]:
#2.
avg_income = selected_df.groupby('BikeBuyer')['YearlyIncome'].mean()
avg_income

BikeBuyer
0    64261.986877
1    79653.968710
Name: YearlyIncome, dtype: float64

In [15]:
#percentage bike buyers by occupation
percentage_bikebuyers = selected_df.groupby('Occupation')['BikeBuyer'].mean() * 100
print(percentage_bikebuyers)

Occupation
Clerical          63.866487
Management        66.934920
Manual            26.265916
Professional      68.184654
Skilled Manual    55.900314
Name: BikeBuyer, dtype: float64

In [20]:
from datetime import datetime
import pandas as pd

# Ensure BirthDate is in datetime format
selected_df.loc[:, 'BirthDate'] = pd.to_datetime(selected_df['BirthDate'], errors='coerce')

# Compute Age
selected_df.loc[:, 'Age'] = datetime.now().year - selected_df['BirthDate'].dt.year
selected_df.head()

,Education,BirthDate,NumberCarsOwned,Occupation,MaritalStatus,HomeOwnerFlag,TotalChildren,YearlyIncome,BikeBuyer,Age
0,Bachelors,1987-11-13,3,Clerical,M,1,1,81916,1,38
1,Partial College,1972-07-21,2,Clerical,M,1,2,81076,1,53
2,Bachelors,1985-11-09,3,Clerical,S,0,0,86387,1,40
3,Partial College,1977-10-18,2,Skilled Manual,M,1,2,61481,1,48
4,Partial College,1975-02-05,1,Skilled Manual,S,1,0,51804,1,50

In [21]:
avg_age = selected_df.groupby('BikeBuyer')['Age'].mean()
print("Average Age by Bike Buyer status:\n", avg_age)

Average Age by Bike Buyer status:
 BikeBuyer
0    42.211665
1    44.415063
Name: Age, dtype: float64

In [22]:
marital_bike = selected_df.groupby('MaritalStatus')['BikeBuyer'].mean() * 100
print("Percentage of Bike Buyers by Marital Status:\n", marital_bike)

Percentage of Bike Buyers by Marital Status:
 MaritalStatus
M    63.838343
S    44.937010
Name: BikeBuyer, dtype: float64